# -*- coding: utf-8 -*-
"""Основы клиент-серверного взаимодействия. Парсинг API.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1k-wPlzj3GYRDayTzHPaCIQpe0FZh7upR

# Основы клиент-серверного взаимодействия. Парсинг API

### выполнил - Колеганов Н.Д.

### Задание

1. Посмотреть документацию к API GitHub, разобраться как вывести список репозиториев для конкретного пользователя, сохранить JSON-вывод в файле *.json.
2. Изучить список открытых API. Найти среди них любое, требующее авторизацию (любого типа). Выполнить запросы к нему, пройдя авторизацию. Ответ сервера записать в файл.

# подгружаем необходимые библиотетки для работы
"""

import requests
import json
from google.colab import files
from pprint import pprint

"""## выбираем url и user"""

url = 'https://api.github.com'
user='nickolas-black'

"""## приступаем к работе"""

r = requests.get(f'{url}/users/{user}/repos')

with open('data_sbor_danny.json', 'w') as f:
    json.dump(r.json(), f)

if len(r.json()) != 0:
    pprint("Список репозиториев пользователя будет ниже перечислен")
else:
    pprint("У пользователя нет репозиториев.")

print('У пользователя ', user, 'следующие репозиттории:')
for i in r.json():
    pprint(i['name'])

!ls

"""## следующее задание

# взял **https://www.artsy.net/**

# пустые данные
"""

client_id = '...'
client_secret = '...'

"""# инициируем запрос на получение токена"""

r = requests.post("https://api.artsy.net/api/tokens/xapp_token",
                  data={
                      "client_id": client_id,
                      "client_secret": client_secret
                  })

"""# разбираем ответ сервера"""

j = json.loads(r.text)

"""# проверяем результат"""

pprint(j)

"""# заполняем данными"""

client_id = 'db311cfe37ec4bc74a61'
client_secret = 'ba1d22427d386b0b79ce4403c063b2ec'

"""# инициируем запрос на получение токена еще раз"""

r2 = requests.post("https://api.artsy.net/api/tokens/xapp_token",
                  data={
                      "client_id": client_id,
                      "client_secret": client_secret
                  })

"""# разбираем ответ сервера еще раз"""

j2 = json.loads(r2.text)

"""# проверяем результат с заполненными данными"""

pprint(j2)

"""# выделяем token из ответа от сервера"""

token = j2["token"]
print(token)

"""# попробуем дальше пойти и получить информацию

## создаем заголовок, содержащий наш токен
"""

headers = {"X-Xapp-Token" : token}

"""## повторим запрос на сервер"""

ok = requests.get("https://api.artsy.net/api/artists/4d8b92b34eb68a1b2c0003f4", headers=headers)

"""## поступивший ответ от сервера"""

j3 = json.loads(ok.text)

"""## содержание json"""

pprint(j3)

print('Имя художника: \n', j3["name"], '\n дата рождения \n', j3["birthday"],'\n биография')
pprint(j3["biography"])